MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN512VLK10/mcu.h
#define ENDADDR                       0x3FFFFFF80000000      // End Address
#define Reserved                      0x000001F0      // This read-only field is reserved and always has the value 1111


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDn_WORD2 register.
//
//*****************************************************************************

#define M7RE                          0x80000000      // Bus Master 7 Read Enable
#define M7WE                          0x40000000      // Bus Master 7 Write Enable
#define M6RE                          0x20000000      // Bus Master 6 Read Enable
#define M6WE                          0x10000000      // Bus Master 6 Write Enable
#define M5RE                          0x08000000      // Bus Master 5 Read Enable
#define M5WE                          0x04000000      // Bus Master 5 Write Enable
#define M4RE                          0x02000000      // Bus Master 4 Read Enable
#define M4WE                          0x01000000      // Bus Master 4 Write Enable
#define Reserved                      0x00800000      // This bit must be written with a zero
#define M3SM                          0x00C00000      // Bus Master 3 Supervisor Mode Access Control
#define M3UM                          0x00700000      // Bus Master 3 User Mode Access Control
#define Reserved                      0x00020000      // This bit must be written with a zero
#define M2SM                          0x00030000      // Bus Master 2 Supervisor Mode Access Control
#define M2UM                          0x0001C000      // Bus Master 2 User Mode Access control
#define Reserved                      0x00000800      // This bit must be written with a zero
#define M1SM                          0x00000C00      // Bus Master 1 Supervisor Mode Access Control
#define M1UM                          0x00000700      // Bus Master 1 User Mode Access Control
#define Reserved                      0x00000020      // This bit must be written with a zero
#define M0SM                          0x00000030      // Bus Master 0 Supervisor Mode Access Control
#define M0UM                          0x0000001C      // Bus Master 0 User Mode Access Control


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDn_WORD3 register.
//
//*****************************************************************************

#define Reserved                      0x3FFFFFFF80000000      // This read-only field is reserved and always has the value 0
#define VLD                           0x00000001      // Valid


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDAACn register.
//
//*****************************************************************************

#define M7RE                          0x80000000      // Bus Master 7 Read Enable
#define M7WE                          0x40000000      // Bus Master 7 Write Enable
#define M6RE                          0x20000000      // Bus Master 6 Read Enable
#define M6WE                          0x10000000      // Bus Master 6 Write Enable
#define M5RE                          0x08000000      // Bus Master 5 Read Enable
#define M5WE                          0x04000000      // Bus Master 5 Write Enable
#define M4RE                          0x02000000      // Bus Master 4 Read Enable
#define M4WE                          0x01000000      // Bus Master 4 Write Enable
#define Reserved                      0x00800000      // This bit must be written with a zero
#define M3SM                          0x00C00000      // Bus Master 3 Supervisor Mode Access Control
#define M3UM                          0x00700000      // Bus Master 3 User Mode Access Control
#define Reserved                      0x00020000      // This bit must be written with a zero
#define M2SM                          0x00030000      // Bus Master 2 Supervisor Mode Access Control
#define M2UM                          0x0001C000      // Bus Master 2 User Mode Access control
#define Reserved                      0x00000800      // This bit must be written with a zero
#define M1SM                          0x00000C00      // Bus Master 1 Supervisor Mode Access Control
#define M1UM                          0x00000700      // Bus Master 1 User Mode Access Control
#define Reserved                      0x00000020      // This bit must be written with a zero
#define M0SM                          0x00000030      // Bus Master 0 Supervisor Mode Access Control
#define M0UM                          0x0000001C      // Bus Master 0 User Mode Access Control


//*****************************************************************************
//
// The following are defines for the bit fields in the AIPSx_MPRA register.
//
//*****************************************************************************

#define MTR0                          0x40000000      // Master Trusted For Read
#define MTW0                          0x20000000      // Master Trusted For Writes
#define MPL0                          0x10000000      // Master Privilege Level
#define MTR1                          0x04000000      // Master trusted for read
#define MTW1                          0x02000000      // Master trusted for writes
#define MPL1                          0x01000000      // Master privilege level
#define MTR2                          0x00400000      // Master Trusted For Read
#define MTW2                          0x00200000      // Master Trusted For Writes
#define MPL2                          0x00100000      // Master Privilege Level
#define MTR3                          0x00040000      // Master Trusted For Read
#define MTW3                          0x00020000      // Master Trusted For Writes
#define MPL3                          0x00010000      // Master Privilege Level
#define MTR4                          0x00004000      // Master Trusted For Read
#define MTW4                          0x00002000      // Master Trusted For Writes
#define MPL4                          0x00001000      // Master Privilege Level
#define MTR5                          0x00000400      // Master Trusted For Read
#define MTW5                          0x00000200      // Master Trusted For Writes
#define MPL5                          0x00000100      // Master Privilege Level


//*****************************************************************************
//
// The following are defines for the bit fields in the AIPSx_PACRn register.
//
//*****************************************************************************

