MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN512VLK10/mcu.h
#define GTN                           0x00007F80      // Guard Band N ::
#define GTN                           0x00007F80      // Guard Band N


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_WF7816 register.
//
//*****************************************************************************

#define GTFD                          0x00007F80      // FD Multiplier ::
#define GTFD                          0x00007F80      // FD Multiplier


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_ET7816 register.
//
//*****************************************************************************

#define TXTHRESHOLD                   0x00000780      // Transmit NACK Threshold ::
#define RXTHRESHOLD                   0x00000078      // Receive NACK Threshold ::
#define TXTHRESHOLD                   0x00000780      // Transmit NACK Threshold
#define RXTHRESHOLD                   0x00000078      // Receive NACK Threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TL7816 register.
//
//*****************************************************************************

#define TLEN                          0x00007F80      // Transmit Length ::
#define TLEN                          0x00007F80      // This value plus four indicates the number of characters contained in the block being transmitted. This register is automatically decremented by 1 for each character in the information field portion of the block. Additionally, this register is automatically decremented by 1 for the first character of a CRC in the epilogue field. Therefore, this register must be programmed with the number of bytes in the data packet if an LRC is being transmitted, and the number of bytes + 1 if a CRC is being transmitted. This register is not decremented for characters that are assumed to be part of the Prologue field, that is, the first three characters transmitted in a block, or the LRC or last CRC character in the Epilogue field, that is, the last character transmitted. This field must be programed or adjusted only when C2[TE] is cleared.


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_C6 register.
//
//*****************************************************************************

#define EN709                         0x00000080      // Enables the CEA709.1-B feature
#define TX709                         0x00000040      // CEA709.1-B Transmit Enable
#define CE                            0x00000020      // Collision Enable
#define CP                            0x00000010      // Collision Signal Polarity
#define EN709                         0x00000080      // Enables the CEA709.1-B feature.
#define TX709                         0x00000040      // Starts CEA709.1-B transmission. This bit is automatically cleared  after  completely  transmitting  the  packet
#define CE                            0x00000020      // Enables the collision detect functionality.
#define CP                            0x00000010      // Indicates the polarity of the collision signal.


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_PCTH register.
//
//*****************************************************************************

#define PCTH                          0x00007F80      // Packet Cycle Time Counter High ::
#define PCTH                          0x00007F80      // Indicates the most significant byte of maximum period after the line code violation (B1 and SDT expired) for which the bus could remain idle without decrementing back log count. If the time elapsed after line code violation (B1 and SDT expired) is greater than packet cycle time, then packet cycle timer expired interrupt is generated. It is measured in terms of bit times, that is, the time it takes for a single bit or one differential Manchester symbol to be transmitted. This is medium dependent and hence does not usually require adjustment and is programmed only once.


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_PCTL register.
//
//*****************************************************************************

#define PCTL                          0x00007F80      // Packet Cycle Time Counter Low ::
#define PCTL                          0x00007F80      // Indicates the least significant byte of maximum period after the line code violation (B1 and SDT expired) for which the bus could remain idle without decrementing back log count. If the time elapsed after line code violation (B1 and SDT expired) is greater than packet cycle time, then packet cycle timer expired interrupt is generated. It is measured in terms of bit times, that is, the time it takes for a single bit or one differential Manchester symbol to be transmitted. This is medium dependent and therefore does not usually require adjustment and is programmed only once.


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_IE0 register.
//
//*****************************************************************************

#define RPLOFIE                       0x00000004      // Receive Packet Length Overflow Interrupt Enable
#define CTXDIE                        0x00000002      // Collision during transmission of byte sync or later packet Interrupt Enable
#define CPTXIE                        0x00000001      // Collision during preamble transmission Interrupt Enable
#define RPLOFIE                       0x00000004      // Interrupt enable for packet receive packet length overflow flag.
#define CTXDIE                        0x00000002      // Interrupt enable for collision during transmission of byte sync or later packet  flag.
#define CPTXIE                        0x00000001      // Interrupt enable for collision during preamble transmission flag.


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_SDTH register.
//
//*****************************************************************************

#define SDTH                          0x00007F80      // Secondary Delay Timer High ::
#define SDTH                          0x00007F80      // This is the most significant byte of the secondary delay timer and is set by software. This is generally a variable value that must be set for each data message to be transmitted. It is measured in bit times, that is, the time that it takes for a single bit or one differential Manchester symbol to be transmitted. This value must be between 0 and (BL*Wbase) + (ProritySlots -1), Beta2 timeslots. A value of zero indicates that the queued packet will be sent immediately upon expiration of the beta1 timer.It is measured in bit times.


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_SDTL register.
//
//*****************************************************************************

#define SDTL                          0x00007F80      // Secondary Delay Timer Low ::
#define SDTL                          0x00007F80      // This is the least significant byte of the secondary delay timer and is set by software. This is generally a variable value that must be set for each data message to be transmitted. It is measured in bit times, that is, the time that it takes for a single bit or one differential Manchester symbol to be transmitted. This value must be between 0 and (BL*Wbase) + (ProritySlots -1), Beta2 timeslots. A value of zero indicates that the queued packet will be sent immediately upon expiration of the Beta1 timer. It is measured in bit times.


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_PRE register.
//
//*****************************************************************************

#define PREAMBLE                      0x00007F80      // CEA709.1-B Preamble Register ::
#define PREAMBLE                      0x00007F80      // The number of bit-sync characters that occur prior to the byte-sync character  when preamble     is transmitted.


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TPL register.
//
//*****************************************************************************

#define TPL                           0x00007F80      // Transmit Packet Length Register ::
#define TPL                           0x00007F80      // Length of the data packet in bytes that is transmitted by CEA709.1-B  transmitter.  This includes    the     CRC packet as well.


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_IE register.
//
//*****************************************************************************

#define PEIE                          0x00000080      // Preamble Error Interrupt Enable
#define WBEIE                         0x00000040      // WBASE Expired Interrupt Enable
#define ISDIE                         0x00000020      // Initial Sync Detection Interrupt Enable
#define PRXIE                         0x00000010      // Packet Received Interrupt Enable
#define PTXIE                         0x00000008      // Packet Transmitted Interrupt Enable
#define PCTEIE                        0x00000004      // Packet Cycle Timer Interrupt Enable
#define PSIE                          0x00000002      // Preamble Start Interrupt Enable
#define TXDIE                         0x00000001      // Transmission Delay Interrupt Enable
#define PEIE                          0x00000080      // Interrupt enable for preamble error flag.
#define WBEIE                         0x00000040      // Interrupt enable for WBASE expired flag.
#define ISDIE                         0x00000020      // Interrupt enable for initial synchronization detection flag.
#define PRXIE                         0x00000010      // Interrupt enable for packet received flag.
#define PTXIE                         0x00000008      // Interrupt enable for packet transmitted flag.
#define PCTEIE                        0x00000004      // Interrupt enable for packet cycle time expired flag.
#define PSIE                          0x00000002      // Interrupt enable for preamble start flag.
#define TXDIE                         0x00000001      // Interrupt enable for transmission delay flag.


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_WB register.
//
//*****************************************************************************

#define WBASE                         0x00007F80      // CEA709.1-B WBASE register ::
#define WBASE                         0x00007F80      // Size of the basic randomizing window in bit periods after Beta1 time  period.  It  is  measured  in  bit  times.


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_S3 register.
//
//*****************************************************************************

