MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN512VLK10/mcu.h
#define PEF                           0x00000080      // Preamble Error Flag
#define WBEF                          0x00000040      // Wbase Expired Flag
#define ISD                           0x00000020      // Initial Sync Detect
#define PRXF                          0x00000010      // Packet Received Flag
#define PTXF                          0x00000008      // Packet Transmitted Flag
#define PCTEF                         0x00000004      // Packet Cycle Timer Expired Flag
#define PSF                           0x00000002      // Preamble Start Flag
#define TXFF                          0x00000001      // Transmission Fail Flag
#define PEF                           0x00000080      // Indicates that the received preamble has an error. If the received preamble length is greater than 390, the preamble error flag is asserted. It is also asserted on detecting line code violation before completely received the preamble. This flag is cleared by writing 1.
#define WBEF                          0x00000040      // Indicates that the Wbase time period has expired after beta1 time slots. This flag is cleared by writing 1.
#define ISD                           0x00000020      // Indicates that initially, a line code violation is detected. This flag is cleared by deasserting EN709 bit.
#define PRXF                          0x00000010      // Indicates that complete packet is received. This flag is cleared by writing 1.
#define PTXF                          0x00000008      // Indicates that complete packet is transmitted. This flag is cleared by writing 1. In case TX packet gets aborted due to FIFO becoming empty or an overflow, packet transmitted flag will still be generated.
#define PCTEF                         0x00000004      // Indicates that packet cycle time period has expired with no activity on the line. This flag is cleared by writing 1.
#define PSF                           0x00000002      // Indicates start of the preamble while the packet is being transmitted. This flag is cleared by writing 1.
#define TXFF                          0x00000001      // Indicates that transmission has encountered error. This flag is asserted while transmission when the TX FIFO becomes empty or overflows. In these cases, line code violation is transmitted on TX line immediately after the current byte transmission is finished, without waiting for completion of transmit packet length. If the transmission fail flag is asserted, C6[TX709] is cleared. This flag should be checked with PTXF flag. This flag is cleared by writing 1.


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_S4 register.
//
//*****************************************************************************

#define LNF                           0x00000020      // LON Noise Flag
#define RPLOF                         0x00000010      // Received Packet Length Overflow Flag
#define CDET                          0x00000018      // Collision Detect
#define TXDF                          0x00000002      // Transmission Delay Flag
#define FE                            0x00000001      // Framing Error
#define LNF                           0x00000020      // Indicates that the noise is present during the sampling of received packet. This flag is set if any of the three samples used to determine the half bit data values in either half of a bit doesn't match the other two samples. The samples are determined at RT3, RT4, RT5 for first half bit and RT11, RT12, RT13 for second half bit. This flag is cleared by writing 1.
#define RPLOF                         0x00000010      // Indicates that the received packet length exceeds 255 bytes. This flag is cleared by writing 1.
#define CDET                          0x00000018      // Indicates when the collision occurs during transmission. This flag is cleared by writing 2'b11. If the collision flag is not cleared by software and a valid collision pulse is detected during some other phase of transmission, then collision flag continues to indicate the previous value.
#define TXDF                          0x00000002      // Indicates that transmission is delayed. This flag is asserted if a packet that is queued for transmission has been delayed because a receive packet started coming in before the packet could be transmitted. In this case C6[TX709] is not cleared automatically. This flag is cleared by writing 1.
#define FE                            0x00000001      // Indicates that the received CEA709.1-B packet has finished at byte boundary. This flag is cleared by writing 1.


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RPL register.
//
//*****************************************************************************

#define RPL                           0x00007F80      // Received Packet Length ::
#define RPL                           0x00007F80      // Indicates the length of received packet in bytes. If the received packet is not byte aligned, the partial byte received is appended by zeros.


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RPREL register.
//
//*****************************************************************************

#define RPREL                         0x00007F80      // Received Preamble Length ::
#define RPREL                         0x00007F80      // Indicates the number of bit sync fields received in the preamble. The length saturates to 255 for the cases where the preamble (bit sync) is larger than 255.


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_CPW register.
//
//*****************************************************************************

#define CPW                           0x00007F80      // CEA709.1-B CPW register ::
#define CPW                           0x00007F80      // Indicates the width of valid collision pulse in terms of IPG clock cycles.
#define CPW                           0x00007F80      // CEA709.1-B CPW register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RIDTH register.
//
//*****************************************************************************

