MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN512VLK10/mcu.h
#define RIDTH                         0x00007F80      // CEA709.1-B Receive IDT register High ::
#define RIDTH                         0x00007F80      // Indicates the most significant byte of indeterminate time period after      reception  during which any activity on RX line will be discarded. Indeterminate time period value should be        less than  Receive Beta1 timer value. It is measured in sample times.
#define RIDTH                         0x00007F80      // CEA709.1-B Receive IDT register High


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RIDTL register.
//
//*****************************************************************************

#define RIDTL                         0x00007F80      // CEA709.1-B Receive IDT register Low ::
#define RIDTL                         0x00007F80      // Indicates the least significant byte of indeterminate time period after reception during which any activity on RX line will be discarded. Indeterminate time period value should be less than Receive Beta1 timer value. It is measured in sample times.
#define RIDTL                         0x00007F80      // CEA709.1-B Receive IDT register Low


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TIDTH register.
//
//*****************************************************************************

#define TIDTH                         0x00007F80      // CEA709.1-B Transmit IDT Register High ::
#define TIDTH                         0x00007F80      // This register indicates the most significant byte of indeterminate time period after transmission   during which any activity on RX line will be discarded. Indeterminate time period value should be less     than Transmit Beta1 timer value. It is measured in sample times.
#define TIDTH                         0x00007F80      // CEA709.1-B Transmit IDT Register High


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TIDTL register.
//
//*****************************************************************************

#define TIDTL                         0x00007F80      // CEA709.1-B Transmit IDT Register Low ::
#define TIDTL                         0x00007F80      // This register indicates the least significant byte of indeterminate time period after transmission  during which any activity on RX line will be discarded. Indeterminate time period value should be less     than Transmit Beta1 timer value. It is measured in sample times.
#define TIDTL                         0x00007F80      // CEA709.1-B Transmit IDT Register Low


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RB1TH register.
//
//*****************************************************************************

#define RB1TH                         0x00007F80      // Receive Beta1 Timer High ::
#define RB1TH                         0x00007F80      // This register indicates the most significant byte of receive Beta1 Timer. Beta1 delay is a value that is system dependent and usually does not require adjustment. It is programmed only once and measured in sample times.
#define RB1TH                         0x00007F80      // Receive Beta1 Timer High


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RB1TL register.
//
//*****************************************************************************

#define RB1TL                         0x00007F80      // Receive Beta1 Timer Low ::
#define RB1TL                         0x00007F80      // This register indicates the least significant byte of receive Beta1 Timer. Beta1  delay is a  value that is system dependent and usually does not require adjustment. It is programmed        only once   and measured    in sample times.
#define RB1TL                         0x00007F80      // Receive Beta1 Timer Low


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TB1TH register.
//
//*****************************************************************************

#define TB1TH                         0x00007F80      // Transmit Beta1 Timer High ::
#define TB1TH                         0x00007F80      // This register indicates the most significant byte of transmit Beta1 Timer. Beta1 delay is a value that is system dependent and usually does not require adjustment. It is programmed only once and measured             in sample times.
#define TB1TH                         0x00007F80      // Transmit Beta1 Timer High


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TB1TL register.
//
//*****************************************************************************

#define TB1TL                         0x00007F80      // Transmit Beta1 Timer Low ::
#define TB1TL                         0x00007F80      // This register indicates the least significant byte of transmit Beta1 Timer. Beta1 delay is a     value that is system dependent and usually does not require adjustment. It is programmed only once             and measured   in sample times.
#define TB1TL                         0x00007F80      // Transmit Beta1 Timer Low


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_PROG_REG register.
//
//*****************************************************************************

#define LCV_LEN                       0x00000780      // Line Code violation length ::
#define MIN_DMC1                      0x00000078      // Minimum DMC-1s ::
#define LCV_LEN                       0x00000780      // This register field provides the programmable value to detect the line code violation. Line code violation is detected if the line code violation counter reached the programmed LCV_LEN. The LCV_LEN has a 5-bit value intenally with programmable 4-bit while the MSbit is forced to '1' to ensure minimum value of 20 on reset.
#define MIN_DMC1                      0x00000078      // This register field indicates the minimum DMC-1s that should be detected before the byte-sync during the preamble detection state.
#define LCV_LEN                       0x00000780      // Line Code violation length
#define MIN_DMC1                      0x00000078      // Minimum DMC-1s


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_STATE_REG register.
//
//*****************************************************************************

#define TX_STATE                      0x000000E0      // LON TX State ::
#define SM_STATE                      0x0000001C      // LON SM State ::
#define TX_STATE                      0x000000E0      // LON TX State
#define SM_STATE                      0x0000001C      // LON SM State


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_DSADDR register.
//
//*****************************************************************************

#define DSADDR                        0x1FFFFFFF80000000      // DMA System Address


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_BLKATTR register.
//
//*****************************************************************************

#define BLKCNT                        0x7FFF80000000      // Blocks Count For Current Transfer
#define BLKSIZE                       0x01FFF000      // Transfer Block Size


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_CMDARG register.
//
//*****************************************************************************

